---
kind: method
id: M:Autodesk.Revit.DB.SunAndShadowSettings.IsAfterStartDateAndTime(System.DateTime)
source: html/7ab7d45b-eea2-5559-d003-74cd29aa6955.htm
---
# Autodesk.Revit.DB.SunAndShadowSettings.IsAfterStartDateAndTime Method

Checks whether the end date and time is valid.

## Syntax (C#)
```csharp
public bool IsAfterStartDateAndTime(
	DateTime time
)
```

## Parameters
- **time** (`System.DateTime`) - Date and time value

## Returns
True if the date and time is valid, false otherwise.